"use strict";

// Задача №1
// Яка назва змінної вірна
// 1) let user-name
// 2) let UserName
// 3) let userName

// Задача №2
// Чи буде помилка при виконанні наступної програми
// const userName = 20
// userName = "Іштван"

// Задача №3
// Що потрапить в консоль?
// let numOne = 20
// let numTwo = "20"
// let numSumm = numOne + numTwo
// console.log(numSumm)

//Задача №1  
// let userName 
//  вірно згідно загальних правил надання імен змінним

//Задача №2
// так буде помилка бо в даному випадку константі надаємо нове значення

//Задача №3
// в консолі виведеться рядок 2020 - так як оператор + в даному випадку виконує конкатенацію рядків не перетворює дані у числа